# правим коментар C 
# Задача 2
# Как се прави променлива ?

# създаваме индефикатор ИЛИ име на променливата
#  в нея ще пазим произволни данни
# оператора = се нарича ПРИСВОЯВАНЕ (равно)
#  in terminal /clear - Чистене на терминал + python + application.py за старт

# first_name = "Кристин"
# print(first_name)
# first_name = "Иван"
# print(first_name)
# family_name = "Георгиев"
# print(family_name)
# age_number = 30
# print(age_number)
# sex_type = "Male"
# print(sex_type)

# Camil Case - Не е  характерно за Python
# firstName = Кристин

# Pascal Case - СВРЪХ НЕ ХАРАКТЕРНО  за Python
# FirstName  = Кристин

#  ПРАВИЛА ЗА ПИСАННЕ НА ПРОМЕНЛИВИ
# 1. Всяка една променлива трябва да е достатъчно описателна
# 2. Типът на променливата трябва да е очевиден от името
# 3. Избягвайте числа в променливите
# 4. НЕ МОЖЕ ДА ЗАПОЧВАТЕ ИМЕ НА ПРОМЕНЛИВА С ЧИСЛО
# 5. Само на Англиски език (само коментари може на друг език)
# 6. Използвайте конвенция с подчетаващи тирета при писане на променливи 
# 7. Всяка променива трябва да има стойност

# str - стринг - текст
# int - integer - цяло число

# first_name = input("въведете първото име: ")
# family_name = input("Фамилия: ")
# sex_type = input("пол: ")
# age_number = input("възраст: ")

# Правим си нова променлива в която да пазим стойността  на първо и второ име
# долепване на текст -- КОНКАТЕНАЦИЯ / Concat
# Ctrl + S - Save / Ctrl + F - Search


# full_name = first_name + " " + family_name
# print("Здравей  "  + full_name ) 

# print( "ти си на "   + age_number)
# print ("ти си с уникален индикатор " +  first_name )


#  Shift + Ctrl  + Дясно наклонена - /  = to mark text
# Задача 4
# артикул характеристика количесто сигнатура на артикула
# Ябълково вино  10 C7544
# пушено месо  5 M7441
# сливов мармалад 9 S6491
# мариновани чушки 4 P7485
# прасенце касичка 184 лв и 35 стотинки B6584


# Когато декларираме променливи винаги е добра идея да добавяме  СУФИКС - които да подсказва типът СТОЙНОСТТА, която носи променлива

apple_wine_volume      = 10
apple_wine_signature   = "C7544"

smoked_ham_weight = 5
smoked_ham_signature = "M7441"

plump_jar_volume = 9
plump_jar_signature = "S6491"

pepar_jar_count = 4
pepar_jar_signature = "P7485"

piggy_bank_amount = 184.35
piggy_bank_signature = "B6584"

# ВИНАГИ  ВИНАГИ - когато работите с дроби, ползвайте ТОЧКА  за разделител между цели и дробни числа.


print(piggy_bank_amount)

